
message = '''
        [\033[32m1\033[33m] Bomber300
        [\033[32m2\033[33m] Пробив номера телефона
        [\033[32m3\033[33m] Настройки
        [\033[32m4\033[33m] Телефонная книга
        [\033[32m5\033[33m] MailBomber300
        [\033[32m6\033[33m] Инструкция
        [\033[31m0\033[33m] Выход 
'''
message7 = "\033[94m \n ЧТо бы вЫйти из прОграМмы нАжмиТе Ctrl + C ! \033[0m"
message5 = "\033[94m \n ЧТо бы вЫйти из прОграМмы нАжмиТе Ctrl + C иЛи на КРЕСТИК в пРавоМ верХнем угЛу. \033[0m"
message1 = "\n        [\033[32m!\033[33m] Изменения применены !"
message8 = """
                  \n
                  \n                 Создатель идеи/Разработчик:
                  \n        [\033[32mИван Зайцев\033[33m] - \033[32mhttps://vk.com/ivan_vzlom300\033[33m
                  \n                \033[33mНад визуальными эффектами\Анимации работали:\033[33m
                  \n        [\033[32mДима Чернышов\033[33m] - \033[32mhttps://vk.com/psih.odinochka\033[33m
                  \n                \033[33mРаботали с сервисами:\033[33m
                  \n        [\033[32mКирилл Гурьев\033[33m] - \033[32mhttps://vk.com/id560704224\033[33m
                  \n
 """

message10 = """

        [\033[32m1\033[33m] Добавить номер
        [\033[32m2\033[33m] Удалить номер
        [\033[32m3\033[33m] Просмотр списка
        [\033[32m0\033[33m] Выйти

"""